/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "该值无效。";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "值“%@”无效。";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "请提供一个有效的值。";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "该值无效。";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "值“%@”无效。";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "该值太小。";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "该值太大。";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "请提供一个有效的值。";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "请提供一个不小于 %@ 的数字。";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "请提供一个介于 %1$@ 和 %2$@ 之间的数字。";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "请提供一个不大于 %@ 的数字。";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "值“%@”太小。";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "值“%@”太大。";

/* NSFileLockingError */
"Err255-C" = "未能锁定该文件。";

/* NSFileLockingError */
"Err255-R" = "该文件可能已经锁定，或者您可能没有锁定它的权限。";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "未能锁定文件“%@”。";

/* NSFileReadUnknownError */
"Err256" = "未能打开该文件。";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "未能打开文件“%@”。";

/* NSFileReadNoPermissionError */
"Err257" = "未能打开该文件，因为您没有查看它的权限。";

/* NSFileReadNoPermissionError */
"Err257-C" = "您没有权限。";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "要查看或更改权限，请在 Finder 中选择项目，然后选取“文件”>“显示简介”。";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "未能打开文件“%@”，因为您没有查看它的权限。";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "该文件名称无效。";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "未能打开该项目，因为文件名称“%@”无效。";

/* NSFileReadCorruptFileError */
"Err259" = "未能打开该文件，因为它的格式不正确。";

/* NSFileReadCorruptFileError */
"Err259-C" = "该文件的格式不正确。";

/* NSFileReadCorruptFileError */
"Err259-R" = "该文件可能已损坏、截断，或者格式与期望的不同。";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "未能打开文件“%@”，因为它的格式不正确。";

/* NSFileReadNoSuchFileError */
"Err260" = "未能打开该文件，因为它不存在。";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "文件夹“%@”不存在。";

/* NSFileReadNoSuchFileError */
"Err260-C" = "该文件不存在。";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "该文件夹不存在。";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "未能打开文件“%@”，因为它不存在。";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "未能使用指定的文本编码打开该文件。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "所指定的文本编码不适用。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "文本编码“%@”不适用。";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "该文件可能已使用了不同的文本编码来存储，或者可能不是文本文件。";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "未能使用文本编码“%@”打开该文件。";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "未能使用文本编码“%1$@”打开文件“%2$@”。";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "未能打开该文件，因为不支持所指定的 URL 类型。";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "不支持所指定的 URL 类型。";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "未能打开文件“%1$@”，因为不支持 URL 类型 %2$@。";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "未能打开该文件，因为不支持 URL 类型 %@。";

/* NSFileReadTooLargeError */
"Err263" = "不能打开该文件，因为文件太大。";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "文件太大。";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "未能打开文件“%@”，因为它太大。";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "未能打开该文件，因为未能确定其内容的文本编码。";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "未能确定该内容的文本编码。";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "您可能需要通过指定一种文本编码来打开该文件。";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "未能打开文件“%@”，因为不能确定其内容的文本编码。";

/* NSUserCancelledError */
"Err3072-C" = "操作已被取消。";

/* NSPropertyListCorruptError */
"Err3840" = "未能读取数据，因为此数据已损坏。";

/* NSPropertyListCorruptError */
"Err3840-C" = "该数据已损坏。";

/* NSPropertyListUnknownVersionError */
"Err3841" = "未能读取数据，因为此应用程序无法识别该数据格式。";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "此应用程序无法识别该数据格式。";

/* NSPropertyListReadStreamError */
"Err3842" = "未能读取数据，因为数据来源发生错误。";

/* NSPropertyListReadStreamError */
"Err3842-C" = "数据来源发生错误。";

/* NSPropertyListWriteStreamError */
"Err3851" = "未能写入数据，因为数据的目的位置发生错误。";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "数据目的位置发生错误。";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "文件夹“%@”不存在。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "未能移去“%@”。";

/* NSFileNoSuchFileError */
"Err4-C" = "该文件不存在。";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "该文件夹不存在。";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "文件“%@”不存在。";

/* NSFileWriteUnknownError */
"Err512" = "未能存储该文件。";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "未能存储文件“%1$@”，因为未能更新备份文件。";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "未能将“%1$@”拷贝到“%2$@”。";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "未能将“%1$@”链接到“%2$@”。";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "未能将“%1$@”移到“%2$@”。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "未能移去“%@”。";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "未能存储备份文件。";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "备份文件可能已被锁定，或者您没有权限来存储它。要查看或更改权限，请在 Finder 中选择项目，然后选取“文件”>“显示简介”。";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "未能将文件“%2$@”存储到文件夹“%1$@”中。";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "未能存储文件“%@”。";

/* NSFileWriteNoPermissionError */
"Err513" = "未能存储该文件，因为您没有权限。";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "未能拷贝“%1$@”，因为您没有访问“%2$@”的权限。";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "未能链接“%1$@”，因为您没有访问“%2$@”的权限。";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "未能移动“%1$@”，因为您没有访问“%2$@”的权限。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "未能移去“%@”，因为您没有访问它的权限。";

/* NSFileWriteNoPermissionError */
"Err513-C" = "您没有权限。";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "要查看或更改权限，请在 Finder 中选择项目，然后选取“文件”>“显示简介”。";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "您没有将文件“%2$@”存储到文件夹“%1$@”中的权限。";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "您没有存储文件“%@”的权限。";

/* NSFileWriteInvalidFileNameError */
"Err514" = "未能存储该项目，因为该文件名称无效。";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "未能移去该项目，因为文件名称“%@”无效。";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "该文件名称无效。";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "未能存储该项目，因为文件名称“%@”无效。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "未能使用指定的文本编码存储该文件。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "所指定的文本编码不适用。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "文本编码“%@”不适用。";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "如果可能，请选择其他文本编码。";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "未能使用文本编码“%@”存储该文件。";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "未能使用文本编码“%1$@”存储文件“%2$@”。";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "未能存储该文件，因为不支持所指定的 URL 类型。";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "不支持所指定的 URL 类型。";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "未能存储文件“%1$@”，因为不支持 URL 类型 %2$@。";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "未能存储该文件，因为不支持 URL 类型 %@。";

/* NSFileWriteOutOfSpaceError */
"Err640" = "未能存储该文件，因为空间不足。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "未能将“%1$@”拷贝到“%2$@”，因为空间不足。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "未能将“%1$@”链接到“%2$@”，因为空间不足。";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "未能将“%1$@”移到“%2$@”，因为空间不足。";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "空间不足。";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "宗卷“%@”空间不足。";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "请从该宗卷移去一些文件，然后再试一次。";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "您不能存储文件“%@”，因为空间不足。";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "您不能存储文件“%1$@”，因为宗卷“%2$@”空间不足。";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "未能存储该文件，因为该宗卷是只读宗卷。";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "该宗卷是只读的。";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "“%@”是只读宗卷。";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "请尝试将文件存储到另一个宗卷。";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "您不能存储文件“%@”，因为该宗卷是只读宗卷。";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "您不能存储文件“%1$@”，因为“%2$@”是只读宗卷。";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "未能完成操作。（“%1$@”错误 %2$ld。）";

